while True:
    # Запитуємо користувача про значення a та b
    a = float(input('Введіть значення a: '))
    b = float(input('Введіть значення b: '))

    # Перевіряємо, чи введені значення a та b є додатніми
    if a > 0 and b > 0:
        break  # Вихід з циклу, якщо користувач ввів додатні значення
    else:
        print('Будь ласка, введіть додатні значення a та b.')

# Обчислюємо значення X відповідно до умов
if a > b:
    x = b * a + 1
elif a == b:
    x = -10
else:
    x = (a - 5) / b

# Виводимо результат
print(f'Значення X: {x}')
